Информационная_база/src/Documents/ПоступлениеТоваров/ПоступлениеТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПоступлениеТоваров</name>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Информационная_база/src/InformationRegisters/ЦеныНоменклатуры/ЦеныНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦеныНоменклатуры</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Информационная_база/src/Enums/Роли/Роли.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Роли</name>
  <enumValues>
    <name>Администратор</name>
  </enumValues>
  <enumValues>
    <name>Пользователь</name>
  </enumValues>
</mdclass:Enum>

Информационная_база/src/Documents/ПоступлениеТоваров/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура ДоговорПриИзмененииНаСервере()
	Объект.Валюта 		= Объект.Договор.Валюта;
	Объект.Контрагент 	= Объект.Договор.Контрагент;
КонецПроцедуры

&НаКлиенте
Процедура ДоговорПриИзменении(Элемент)
	ДоговорПриИзмененииНаСервере();  
	ОбновлениеТоваров();
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	ОбновлениеТоваров();
КонецПроцедуры

&НаКлиенте
Процедура ОбновлениеТоваров()
	Для Каждого Товар Из Объект.Товары Цикл
		Товар.Цена = ТоварыНоменклатураПриИзмененииНаСервере(Товар.Номенклатура);
	КонецЦикла;
КонецПроцедуры

&НаСервере
Функция ТоварыНоменклатураПриИзмененииНаСервере(Номенклатура) 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
	               |	ЦеныНоменклатурыСрезПоследних.Валюта КАК Валюта,
	               |	ЦеныНоменклатурыСрезПоследних.Цена КАК Цена
	               |ИЗ
	               |	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&Дата, ) КАК ЦеныНоменклатурыСрезПоследних
	               |ГДЕ
	               |	ЦеныНоменклатурыСрезПоследних.Номенклатура = &Номенклатура
	               |	И ЦеныНоменклатурыСрезПоследних.Валюта = &Валюта";     
			   
	Запрос.УстановитьПараметр("Номенклатура", 	Номенклатура);
	Запрос.УстановитьПараметр("Валюта",       	Объект.Валюта);
	Запрос.УстановитьПараметр("Дата",       	Объект.Дата);
 			   
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Цена;		
	КонецЦикла;  
	
КонецФункции

&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	Номенклатура 	= Элементы.Товары.ТекущиеДанные.Номенклатура;
	Элементы.Товары.ТекущиеДанные.Цена = ТоварыНоменклатураПриИзмененииНаСервере(Номенклатура);
КонецПроцедуры 

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Объект.Ответственный = ПараметрыСеанса.ТекущийПользователь;   
	
	Если ПараметрыСеанса.ТекущийПользователь.Роль = Перечисления.Роли.Пользователь Тогда
		Элементы.Ответственный.ТолькоПросмотр = Истина;
	КонецЕсли;   
	
КонецПроцедуры
